marangisto/AVR/hardware/TeeOnArdu/boards.txt
//TeeOnArdu
menu.usb=USB Type
menu.keys=Keyboard Layout

TeeOnArdu.name=TeeOnArdu (Leo on TeensyCore)
TeeOnArdu.upload.protocol=avr109
TeeOnArdu.upload.maximum_size=28672
TeeOnArdu.upload.speed=57600
TeeOnArdu.upload.disable_flushing=true
TeeOnArdu.bootloader.low_fuses=0xff
TeeOnArdu.bootloader.high_fuses=0xd8
TeeOnArdu.bootloader.extended_fuses=0xcb
TeeOnArdu.bootloader.path=caterina
TeeOnArdu.bootloader.file=Caterina-Leonardo.hex
TeeOnArdu.bootloader.unlock_bits=0x3F
TeeOnArdu.bootloader.lock_bits=0x2F
TeeOnArdu.serial.restart_cmd=true
TeeOnArdu.serial.safe_baud_rates_only=true
TeeOnArdu.build.mcu=atmega32u4
TeeOnArdu.build.core=TeeOnArdu
TeeOnArdu.build.vid=0x2341
TeeOnArdu.build.pid=0x8036 
TeeOnArdu.build.f_cpu=16000000L
TeeOnArdu.build.variant=leonardo
TeeOnArdu.build.elide_constructors=true
TeeOnArdu.build.cpp0x=true
TeeOnArdu.build.dependency=true
TeeOnArdu.build.linker_relaxation=true
TeeOnArdu.build.serial_number=true
TeeOnArdu.menu.usb.serial.name=Serial
TeeOnArdu.menu.usb.serial.build.define0=-DUSB_SERIAL
TeeOnArdu.menu.usb.hid.name=Keyboard + Mouse + Joystick
TeeOnArdu.menu.usb.hid.build.define0=-DUSB_HID
TeeOnArdu.menu.usb.hid.fake_serial=teensy_gateway
TeeOnArdu.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
TeeOnArdu.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
TeeOnArdu.menu.usb.int_disk.name=Disk(Internal) + Keyboard
TeeOnArdu.menu.usb.int_disk.build.define0=-DUSB_DISK
TeeOnArdu.menu.usb.int_disk.fake_serial=teensy_gateway
TeeOnArdu.menu.usb.int_disk.build.elfpatch=mktinyfat
TeeOnArdu.menu.usb.sd_disk.name=Disk(SD Card) + Keyboard
TeeOnArdu.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
TeeOnArdu.menu.usb.sd_disk.fake_serial=teensy_gateway
TeeOnArdu.menu.usb.midi.name=MIDI
TeeOnArdu.menu.usb.midi.build.define0=-DUSB_MIDI
TeeOnArdu.menu.usb.midi.fake_serial=teensy_gateway
TeeOnArdu.menu.usb.rawhid.name=Raw HID
TeeOnArdu.menu.usb.rawhid.build.define0=-DUSB_RAWHID
TeeOnArdu.menu.usb.rawhid.fake_serial=teensy_gateway
TeeOnArdu.menu.usb.flightsim.name=Flight Sim Controls
TeeOnArdu.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
TeeOnArdu.menu.usb.flightsim.fake_serial=teensy_gateway
TeeOnArdu.menu.keys.en-us.name=US English
TeeOnArdu.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
TeeOnArdu.menu.keys.fr-ca.name=Canadian French
TeeOnArdu.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
TeeOnArdu.menu.keys.xx-ca.name=Canadian Multilingual
TeeOnArdu.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
TeeOnArdu.menu.keys.da-da.name=Danish
TeeOnArdu.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
TeeOnArdu.menu.keys.fi-fi.name=Finnish
TeeOnArdu.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
TeeOnArdu.menu.keys.fr-fr.name=French
TeeOnArdu.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
TeeOnArdu.menu.keys.fr-be.name=French Belgian
TeeOnArdu.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
TeeOnArdu.menu.keys.fr-ch.name=French Swiss
TeeOnArdu.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
TeeOnArdu.menu.keys.de-de.name=German
TeeOnArdu.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
TeeOnArdu.menu.keys.de-dm.name=German (Mac)
TeeOnArdu.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
TeeOnArdu.menu.keys.de-ch.name=German Swiss
TeeOnArdu.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
TeeOnArdu.menu.keys.is-is.name=Icelandic
TeeOnArdu.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
TeeOnArdu.menu.keys.en-ie.name=Irish
TeeOnArdu.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
TeeOnArdu.menu.keys.it-it.name=Italian
TeeOnArdu.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
TeeOnArdu.menu.keys.no-no.name=Norwegian
TeeOnArdu.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
TeeOnArdu.menu.keys.pt-pt.name=Portuguese
TeeOnArdu.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
TeeOnArdu.menu.keys.pt-br.name=Portuguese Brazilian
TeeOnArdu.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
TeeOnArdu.menu.keys.es-es.name=Spanish
TeeOnArdu.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
TeeOnArdu.menu.keys.es-mx.name=Spanish Latin America
TeeOnArdu.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
TeeOnArdu.menu.keys.sv-se.name=Swedish
TeeOnArdu.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
TeeOnArdu.menu.keys.en-gb.name=United Kingdom
TeeOnArdu.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
TeeOnArdu.menu.keys.usint.name=US International
TeeOnArdu.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

FloraTeensyCore.name=Flora (TeensyCore)
FloraTeensyCore.upload.protocol=avr109
FloraTeensyCore.upload.maximum_size=28672
FloraTeensyCore.upload.speed=57600
FloraTeensyCore.upload.disable_flushing=true
FloraTeensyCore.bootloader.low_fuses=0xff
FloraTeensyCore.bootloader.high_fuses=0xd8
FloraTeensyCore.bootloader.extended_fuses=0xcb
FloraTeensyCore.bootloader.path=caterina
FloraTeensyCore.bootloader.file=Caterina-Flora8.hex
FloraTeensyCore.bootloader.unlock_bits=0x3F
FloraTeensyCore.bootloader.lock_bits=0x2F
FloraTeensyCore.serial.restart_cmd=true
FloraTeensyCore.serial.safe_baud_rates_only=true
FloraTeensyCore.build.mcu=atmega32u4
FloraTeensyCore.build.core=TeeOnArdu
FloraTeensyCore.build.vid=0x239A
FloraTeensyCore.build.pid=0x8004 
FloraTeensyCore.build.f_cpu=8000000L
FloraTeensyCore.build.variant=flora
FloraTeensyCore.build.elide_constructors=true
FloraTeensyCore.build.cpp0x=true
FloraTeensyCore.build.dependency=true
FloraTeensyCore.build.linker_relaxation=true
FloraTeensyCore.build.serial_number=true
FloraTeensyCore.menu.usb.serial.name=Serial
FloraTeensyCore.menu.usb.serial.build.define0=-DUSB_SERIAL
FloraTeensyCore.menu.usb.hid.name=Keyboard + Mouse + Joystick
FloraTeensyCore.menu.usb.hid.build.define0=-DUSB_HID
FloraTeensyCore.menu.usb.hid.fake_serial=teensy_gateway
FloraTeensyCore.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
FloraTeensyCore.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
FloraTeensyCore.menu.usb.int_disk.name=Disk(Internal) + Keyboard
FloraTeensyCore.menu.usb.int_disk.build.define0=-DUSB_DISK
FloraTeensyCore.menu.usb.int_disk.fake_serial=teensy_gateway
FloraTeensyCore.menu.usb.int_disk.build.elfpatch=mktinyfat
FloraTeensyCore.menu.usb.sd_disk.name=Disk(SD Card) + Keyboard
FloraTeensyCore.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
FloraTeensyCore.menu.usb.sd_disk.fake_serial=teensy_gateway
FloraTeensyCore.menu.usb.midi.name=MIDI
FloraTeensyCore.menu.usb.midi.build.define0=-DUSB_MIDI
FloraTeensyCore.menu.usb.midi.fake_serial=teensy_gateway
FloraTeensyCore.menu.usb.rawhid.name=Raw HID
FloraTeensyCore.menu.usb.rawhid.build.define0=-DUSB_RAWHID
FloraTeensyCore.menu.usb.rawhid.fake_serial=teensy_gateway
FloraTeensyCore.menu.usb.flightsim.name=Flight Sim Controls
FloraTeensyCore.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
FloraTeensyCore.menu.usb.flightsim.fake_serial=teensy_gateway
FloraTeensyCore.menu.keys.en-us.name=US English
FloraTeensyCore.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
FloraTeensyCore.menu.keys.fr-ca.name=Canadian French
FloraTeensyCore.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
FloraTeensyCore.menu.keys.xx-ca.name=Canadian Multilingual
FloraTeensyCore.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
FloraTeensyCore.menu.keys.da-da.name=Danish
FloraTeensyCore.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
FloraTeensyCore.menu.keys.fi-fi.name=Finnish
FloraTeensyCore.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
FloraTeensyCore.menu.keys.fr-fr.name=French
FloraTeensyCore.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
FloraTeensyCore.menu.keys.fr-be.name=French Belgian
FloraTeensyCore.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
FloraTeensyCore.menu.keys.fr-ch.name=French Swiss
FloraTeensyCore.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
FloraTeensyCore.menu.keys.de-de.name=German
FloraTeensyCore.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
FloraTeensyCore.menu.keys.de-dm.name=German (Mac)
FloraTeensyCore.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
FloraTeensyCore.menu.keys.de-ch.name=German Swiss
FloraTeensyCore.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
FloraTeensyCore.menu.keys.is-is.name=Icelandic
FloraTeensyCore.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
FloraTeensyCore.menu.keys.en-ie.name=Irish
FloraTeensyCore.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
FloraTeensyCore.menu.keys.it-it.name=Italian
FloraTeensyCore.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
FloraTeensyCore.menu.keys.no-no.name=Norwegian
FloraTeensyCore.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
FloraTeensyCore.menu.keys.pt-pt.name=Portuguese
FloraTeensyCore.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
FloraTeensyCore.menu.keys.pt-br.name=Portuguese Brazilian
FloraTeensyCore.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
FloraTeensyCore.menu.keys.es-es.name=Spanish
FloraTeensyCore.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
FloraTeensyCore.menu.keys.es-mx.name=Spanish Latin America
FloraTeensyCore.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
FloraTeensyCore.menu.keys.sv-se.name=Swedish
FloraTeensyCore.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
FloraTeensyCore.menu.keys.en-gb.name=United Kingdom
FloraTeensyCore.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
FloraTeensyCore.menu.keys.usint.name=US International
FloraTeensyCore.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

